In [1]:
%reload_ext sql
%config SqlMagic.style = '_DEPRECATED_DEFAULT'
%sql sqlite:///practice.db

# Order by, limits and offsets

In [ ]:
# Syntax

# SELECT ...
#   FROM ...
#   ORDER BY ...
#   ASC
#   LIMIT ...;

# Operators: =, != or <>, <, >, <=, >=, BETWEEN, LIKE, IN, IS NULL

In [5]:
%%sql

-- Show longest serving 3 employees

SELECT * FROM employees ORDER BY hire_date ASC LIMIT 3;

 * sqlite:///practice.db
Done.

[(4, 'Dana', 3, 70000, '2017-09-05'),
 (1, 'Alice', 1, 90000, '2018-03-21'),
 (2, 'Bob', 1, 80000, '2019-07-15')]

In [8]:
%%sql

-- Show 2nd,3rd and 4th highest paid 3 employees

SELECT * FROM employees ORDER BY salary DESC LIMIT 3 OFFSET 1;

 * sqlite:///practice.db
Done.

[(2, 'Bob', 1, 80000, '2019-07-15'),
 (5, 'Eve', None, 72000, '2021-11-23'),
 (4, 'Dana', 3, 70000, '2017-09-05')]

# Questions

In [10]:
# Exercises

# 1. Show top 2 highest paid employees (name and salary).
# 2. List products ordered by price ascending.
# 3. Show customers ordered by name, but skip the first one (use OFFSET ).

# Answers

In [13]:
%%sql
-- 1
SELECT name, salary FROM employees ORDER BY salary DESC LIMIT 2;

 * sqlite:///practice.db
Done.

[('Alice', 90000), ('Bob', 80000)]

In [15]:
%%sql
-- 2 
SELECT * FROM products ORDER BY price ASC;

 * sqlite:///practice.db
Done.

[(4, 'Notebook', 'Stationery', 3.5),
 (3, 'Mug', 'Home', 8.5),
 (2, 'Mouse', 'Electronics', 25.0),
 (1, 'Laptop', 'Electronics', 1200.0)]

In [18]:
%%sql
-- 3
SELECT * FROM customers;

 * sqlite:///practice.db
Done.

[(1, 'Acme Corp', 'London'),
 (2, 'Bright Co', 'Berlin'),
 (3, 'Cafe 123', 'Paris')]

In [24]:
%%sql
-- 3
SELECT * FROM customers ORDER BY name LIMIT 3 OFFSET 1;

 * sqlite:///practice.db
Done.

[(2, 'Bright Co', 'Berlin'), (3, 'Cafe 123', 'Paris')]

# Solutions

In [ ]:
# 1 - SELECT name, salary FROM employees ORDER BY salary DESC LIMIT 2;
# 2 - SELECT name, price FROM products ORDER BY price ASC;
# 3 - SELECT name, city FROM customers ORDER BY name ASC LIMIT 100 OFFSET 1;